JoseAmador95/stm32f401re/include/stm32f401-registers.h
#ifndef __STM32F401RE_REGISTER_BITS_H_
#define __STM32F401RE_REGISTER_BITS_H_

/**
 * @addtogroup CRC
 * @{
 * @name Registers
 * @{
 * @name DR
 * @{
 * @brief Data Register
 */
#define CRC_CR_DR 0 //!< [32-bit] Data Register bits
/** @} */

/**
 * @name IDR
 * @{
 * @brief Independent Data Register
 */
#define CRC_IDR_IDR //!< [8-bit] General purpose register bits
/** @} */

/**
 * @name CR
 * @{
 * @brief Control Register
 */
#define CRC_CR_RESET 0 //!< [1-bit] Reset bit 
/** @} */
/** @} */
/** @} */

/** 
 * @addtogroup PWR
 * @{
 * @name Registers
 * @{
 * @name CR
 * @{
 * @brief Control Register
 */
#define PWR_CR_LPDS 0     //!< [1-bit] Low-power deepsleep
#define PWR_CR_PDDS 1     //!< [1-bit] Power-down deepsleep
#define PWR_CR_CWUF 2     //!< [1-bit] Clear wakeup flag
#define PWR_CR_CSBF 3     //!< [1-bit] Clear standy flag
#define PWR_CR_PVDE 4     //!< [1-bit] Power voltage detector enable
#define PWR_CR_PLS 5      //!< [3-bit] Power voltage detection level selection
#define PWR_CR_DBP 8      //!< [1-bit] Disable backup domain write protection
#define PWR_CR_FPDS 9     //!< [1-bit] Flash power-down in stop mode
#define PWR_CR_LPLVDS 10  //!< [1-bit] Low-power regulator Low Voltage in Deep Sleep
#define PWR_CR_MRLVDS 11  //!< [1-bit] Main regulator Low voltage in Deep Sleep
#define PWR_CR_ADCD1 13   //!< [1-bit] ADCD1
#define PWR_CR_VOS 14     //!< [2//!< [1-bit] e WKUP pin
#define PWR_CSR_BRE 9     //!< [1-bit] Backup regulator enable
#define PWR_CSR_VOSRDY 14 //!< [1-bit] Regulator voltage scaling output selection ready bit
/** @} */
/** @} */
/** @} */


/**
 * @addtogroup RCC
 * @{
 * @name Registers
 * @{
 * @name CR
 * @{
 * @brief Control Register
 */
#define RCC_CR_HSION 0      //!< [1-bit] Internal high-speed clock enable
#define RCC_CR_HSIRDY 1     //!< [1-bit] Internal high-speed clock ready flag
#define RCC_CR_HSITRIM 3    //!< [5-bit] Internal high-speed clock trimming
#define RCC_CR_HSICAL 8     //!< [8-bit] Internal high-speed clock calibration
#define RCC_CR_HSEON 16     //!< [1-bit] HSE clock enable
#define RCC_CR_HSERDY 17    //!< [1-bit] HSE clock ready flag
#define RCC_CR_HSEBYP 18    //!< [1-bit] HSE clock bypass
#define RCC_CR_CSSON 19     //!< [1-bit] Clock security system enable
#define RCC_CR_PLLON 24     //!< [1-bit] Main PLL enable
#define RCC_CR_PLLRDY 25    //!< [1-bit] Main PLL clock ready flag
#define RCC_CR_PLLI2SON 26  //!< [1-bit] PLLI2S enable
#define RCC_CR_PLLI2SRDY 27 //!< [1-bit] PLLI2S clock ready flag
/** @} */

/**
 * @name PLLCFG
 * @{
 * @brief PLL Configuration Register
 */
#define RCC_PLLCFGR_PLLM 0    //!< [6-bit] Division factor for the main PLL and PLLI2S
#define RCC_PLLCFGR_PLLN 6    //!< [9-bit] Main PLL multiplication facotr for VCO
#define RCC_PLLCFGR_PLLP 16   //!< [2-bit] Main PLL division factor for main system clock
#define RCC_PLLCFGR_PLLSRC 22 //!< [1-bit] Main PLL and PLLI2S entry clock source
#define RCC_PLLCFGR_PLLQ 24   //!< [4-bit] Main PLL division factor for USB OTG, SDIO and Random number Gen
/** @} */

/** 
 * @name CFGR
 * @{
 * @brief Clock Configuration Register
 */
#define RCC_CFGR_SW 0       //!< [2-bit] System clock switch
#define RCC_CFGR_SWS 2      //!< [2-bit] System clock switch status
#define RCC_CFGR_HPRE 4     //!< [4-bit] AHB prescaler
#define RCC_CFGR_PPRE1 10   //!< [3-bit] APB1 low-speed prescaler
#define RCC_CFGR_PPRE2 13   //!< [3-bit] APB2 high-speed prescaler
#define RCC_CFGR_RTCPRE 16  //!< [5-bit] HSE dicision factor for RTC clock
#define RCC_CFGR_MCO1 21    //!< [2-bit] Microcontroller clock output 1
#define RCC_CFGR_I2SSRC 23  //!< [1-bit] I2S clock selection
#define RCC_CFGR_MCO1PRE 24 //!< [3-bit] MCO1 prescaler
#define RCC_CFGR_MCO2PRE 27 //!< [3-bit] MCO2 prescaler
#define RCC_CFGR_MCO2 30    //!< [2-bit] Microcontroller clock output 2
/** @} */

/**
 * @name CIR
 * @{
 * @brief Clock Interrupt Register
 */
#define RCC_CIR_LSIRDYF 0      //!< [1-bit] LSI ready interrupt flag
#define RCC_CIR_LSERDYF 1      //!< [1-bit] LSE ready interrupt flag
#define RCC_CIR_HSIRDYF 2      //!< [1-bit] HSI ready interrupt flag
#define RCC_CIR_HSERFYF 3      //!< [1-bit] HSE ready interrupt flag
#define RCC_CIR_PLLRDYF 4      //!< [1-bit] Main PLL ready interrupt flag
#define RCC_CIR_PLLI2SRDYF 5   //!< [1-bit] PLLI2S ready interrupt flag
#define RCC_CIR_CSSF 7         //!< [1-bit] CLock security system interrupt flag
#define RCC_CIR_LSIRDYIE 8     //!< [1-bit] LSI ready interrupt enable
#define RCC_CIR_LSERDYIE 9     //!< [1-bit] LSE ready interrupt enable
#define RCC_CIR_HSIRDYIE 10    //!< [1-bit] HSI ready interrupt enable
#define RCC_CIR_HSERDYIE 11    //!< [1-bit] HSE ready interrupt enable
#define RCC_CIR_PLLRDYUE 12    //!< [1-bit] Main PLL ready interrupt enable
#define RCC_CIR_PLLI2SRDYIE 13 //!< [1-bit] PLLI2C ready interrupt enable
#define RCC_CIR_LSIRDYC 16     //!< [1-bit] LSI ready interrupt clear
#define RCC_CIR_LSERDYC 17     //!< [1-bit] LSE ready interrupt clear
#define RCC_CIR_HSIRDYC 18     //!< [1-bit] HSI ready interrupt clear
#define RCC_CIR_HSERDYC 19     //!< [1-bit] HSE ready interrupt clear
#define RCC_CIR_PLLRDYC 20     //!< [1-bit] Main PLL ready interrupt clear
#define RCC_CIR_PLLI2CRDYC 21  //!< [1-bit] PLLI2C ready interrupt clear
#define RCC_CIR_CSSC 23        //!< [1-bit] Clock security system interrupt clear
/** @} */

/** 
 * @name AHB1RSTR
 * @{
 * @brief AHB1 Peripheral Reset Register
 */
#define RCC_AHB1RSTR_GPIOARST 0 //!< [1-bit] GPIO port A reset
#define RCC_AHB1RSTR_GPIOBRST 1 //!< [1-bit] GPIO port B reset
#define RCC_AHB1RSTR_GPIOCRST 2 //!< [1-bit] GPIO port C reset
#define RCC_AHB1RSTR_GPIODRST 3 //!< [1-bit] GPIO port D reset
#define RCC_AHB1RSTR_GPIOERST 4 //!< [1-bit] GPIO port E reset
#define RCC_AHB1RSTR_GPIOHRST 7 //!< [1-bit] GPIO port H reset
#define RCC_AHB1RSTR_CRCRST 12  //!< [1-bit] CRC reset
#define RCC_AHB1RSTR_DMA1RST 21 //!< [1-bit] DMA1 reset
#define RCC_AHB1RSTR_DMA2RST 22 //!< [1-bit] DMA2 reset
/** @} */

/**
 * @name AHB2RSTR
 * @{
 * @brief AHB2 Peripheral Reset Register
 */
#define RCC_AHB2RSTR_OTGFSRST 7 //!< [1-bit] USB OTG reset
/** @} */

/**
 * @name APB1RSTR
 * @{
 * @brief APB1 Peripheral Reset Register
 */
#define RCC_APB1RSTR_TIM2RST 0    //!< [1-bit] Timer 2 reset
#define RCC_APB1RSTR_TIM3RST 1    //!< [1-bit] Timer 3 reset
#define RCC_APB1RSTR_TIM4RST 2    //!< [1-bit] TImer 4 reset
#define RCC_APB1RSTR_TIM5RST 3    //!< [1-bit] Timer 5 reset
#define RCC_APB1RSTR_WWDGRST 11   //!< [1-bit] Window watchdog reset
#define RCC_APB1RSTR_SPI2RST 14   //!< [1-bit] SPI2 reset
#define RCC_APB1RSTR_SPI3RST 15   //!< [1-bit] SPI3 reset
#define RCC_APB1RSTR_USART2RST 17 //!< [1-bit] USART2 reset
#define RCC_APB1RSTR_I2C1RST 21   //!< [1-bit] I2C1 reset
#define RCC_APB1RSTR_I2C2RST 22   //!< [1-bit] I2C2 reset
#define RCC_APB1RSTR_I2C3RST 23   //!< [1-bit] I2C3 reset
#define RCC_APB1RSTR_PWRRST 28    //!< [1-bit] Power interface reset
/** @} */

/**
 * @name APB2RSTR
 * @{
 * @brief APB2 Peripheral Reset Register
 */
#define RCC_APB2RSTR_TIM1RST 0    //!< [1-bit] Timer 1 reset
#define RCC_APB2RSTR_USART1RST 4  //!< [1-bit] USART1 reset
#define RCC_APB2RSTR_USART6RST 5  //!< [1-bit] USART6 reset
#define RCC_APB2RSTR_ADC1RST 8    //!< [1-bit] ADC1 reset
#define RCC_APB2RSTR_SDIORST 11   //!< [1-bit] SDIO reset
#define RCC_APB2RSTR_SPI1RST 12   //!< [1-bit] SPI1 reset
#define RCC_APB2RSTR_SPI4RST 13   //!< [1-bit] SPI4 reset
#define RCC_APB2RSTR_SYSCFGRST 14 //!< [1-bit] System configuration controller reset
#define RCC_APB2RSTR_TIM9RST 16   //!< [1-bit] Timer 9 reset
#define RCC_APB2RSTR_TIM10RST 17  //!< [1-bit] Timer 10 reset
#define RCC_APB2RSTR_TIM11RST 18  //!< [1-bit] Timer 11 reset
/** @} */

/**
 * @name AHB1ENR
 * @{
 * @brief AHB1 Periheral Clock Enable Register
 */
#define RCC_AHB1ENR_GPIOAEN 0 //!< [1-bit] GPIO port A clock enable
#define RCC_AHB1ENR_GPIOBEN 1 //!< [1-bit] GPIO port B clock enable
#define RCC_AHB1ENR_GPIOCEN 2 //!< [1-bit] GPIO port C clock enable
#define RCC_AHB1ENR_GPIODEN 3 //!< [1-bit] GPIO port D clock enable
#define RCC_AHB1ENR_GPIOEEN 4 //!< [1-bit] GPIO port E clock enable
#define RCC_AHB1ENR_GPIOHEN 7 //!< [1-bit] GPIO port H clock enable
#define RCC_AHB1ENR_CRCEN 12  //!< [1-bit] CRC clock enable
#define RCC_AHB1ENR_DMA1EN 21 //!< [1-bit] DMA1 clock enable
#define RCC_AHB1ENR_DMA2EN 22 //!< [1-bit] DMA2 clock enable
/** @} */

/**
 * @name AHB2ENR
 * @{
 * @brief AHB2 Peripheral Clock Enable Register
 */
#define RCC_AHB2ENR_OTGFSEN 7 //!< [1-bit] USB OTG clock enable
/** @} */

/**
 * @name APB1ENR
 * @{
 * @brief APB1 Peripheral Clock Enable Register
 */
#define RCC_APB1ENR_TIM2EN 0    //!< [1-bit] Timer 2 clock enable
#define RCC_APB1ENR_TIM3EN 1    //!< [1-bit] Timer 3 clock enable
#define RCC_APB1ENR_TIM4EN 2    //!< [1-bit] TImer 4 clock enable
#define RCC_APB1ENR_TIM5EN 3    //!< [1-bit] Timer 5 clock enable
#define RCC_APB1ENR_WWDGEN 11   //!< [1-bit] Window watchdog clock enable
#define RCC_APB1ENR_SPI2EN 14   //!< [1-bit] SPI2 clock enable
#define RCC_APB1ENR_SPI3EN 15   //!< [1-bit] SPI3 clock enable
#define RCC_APB1ENR_USART2EN 17 //!< [1-bit] USART2 clock enable
#define RCC_APB1ENR_I2C1EN 21   //!< [1-bit] I2C1 clock enable
#define RCC_APB1ENR_I2C2EN 22   //!< [1-bit] I2C2 clock enable
#define RCC_APB1ENR_I2C3EN 23   //!< [1-bit] I2C3 clock enable
#define RCC_APB1ENR_PWREN 28    //!< [1-bit] Power interface clock enable
/** @} */

/**
 * @name APB2ENR
 * @{
 * @brief APB2 Peripheral Clock Enable Register
 */
#define RCC_APB2ENR_TIM1EN 0    //!< [1-bit] Timer 1 clock enable
#define RCC_APB2ENR_USART1EN 4  //!< [1-bit] USART1 clock enable
#define RCC_APB2ENR_USART6EN 5  //!< [1-bit] USART6 clock enable
#define RCC_APB2ENR_ADC1EN 8    //!< [1-bit] ADC1 clock enable
#define RCC_APB2ENR_SDIOEN 11   //!< [1-bit] SDIO clock enable
#define RCC_APB2ENR_SPI1EN 12   //!< [1-bit] SPI1 clock enable
#define RCC_APB2ENR_SPI4EN 13   //!< [1-bit] SPI4 clock enable
#define RCC_APB2ENR_SYSCFGEN 14 //!< [1-bit] System configuration controller clock enable
#define RCC_APB2ENR_TIM9EN 16   //!< [1-bit] Timer 9 clock enable
#define RCC_APB2ENR_TIM10EN 17  //!< [1-bit] Timer 10 clock enable
#define RCC_APB2ENR_TIM11EN 18  //!< [1-bit] Timer 11 clock enable
/** @} */

/**
 * @name AHB1LPENR
 * @{
 * @brief AHB1 Peripheral Clock Enable in Low Power Mode Register
 */
#define RCC_AHB1LPENR_GPIOALPEN 0  //!< [1-bit] GPIO port A clock enabled during sleep mode
#define RCC_AHB1LPENR_GPIOBLPEN 1  //!< [1-bit] GPIO port B clock enabled during sleep mode
#define RCC_AHB1LPENR_GPIOCLPEN 2  //!< [1-bit] GPIO port C clock enabled during sleep mode
#define RCC_AHB1LPENR_GPIODLPEN 3  //!< [1-bit] GPIO port D clock enabled during sleep mode
#define RCC_AHB1LPENR_GPIOELPEN 4  //!< [1-bit] GPIO port E clock enabled during sleep mode
#define RCC_AHB1LPENR_GPIOHLPEN 7  //!< [1-bit] GPIO port H clock enabled during sleep mode
#define RCC_AHB1LPENR_CRCLPEN 12   //!< [1-bit] CRC clock enabled during sleep mode
#define RCC_AHB1LPENR_FLITFLPEN 15 //!< [1-bit] Flash interface clock enabled during sleep mode
#define RCC_AHB1LPENR_SRAM1LPEN 16 //!< [1-bit] SRAM1 interface clock enabled during sleep mode
#define RCC_AHB1LPENR_DMA1LPEN 21  //!< [1-bit] DMA1 clock enabled during sleep mode
#define RCC_AHB1LPENR_DMA2LPEN 22  //!< [1-bit] DMA2 clock enabled during sleep mode
/** @} */

/**
 * @name AHB2LPENR
 * @{
 * @brief AHB2 Peripheral Clock Enable in Low Power Mode Register
 */
#define RCC_AHB2LPENR_OTGFSLPEN 7 //!< [1-bit] USB OTG FS clock enabled during sleep mode
/** @} */

/** 
 * @name APB1LPENR
 * @{
 * @brief APB1 Peripheral Clock Enable in Low Power Mode Register
 */
#define RCC_APB1LPENR_TIM2LPEN 0    //!< [1-bit] TIM2 clock enable dutin sleep mode
#define RCC_APB1LPENR_TIM3LPEN 1    //!< [1-bit] TIM3 clock enable dutin sleep mode
#define RCC_APB1LPENR_TIM4LPEN 2    //!< [1-bit] TIM4 clock enable dutin sleep mode
#define RCC_APB1LPENR_TIM5LPEN 3    //!< [1-bit] TIM5 clock enable dutin sleep mode
#define RCC_APB1LPENR_WWDGLPEN 11   //!< [1-bit] WWDG clock enable dutin sleep mode
#define RCC_APB1LPENR_SPI2LPEN 14   //!< [1-bit] SPI2 clock enable dutin sleep mode
#define RCC_APB1LPENR_SPI3LPEN 15   //!< [1-bit] SPI3 clock enable dutin sleep mode
#define RCC_APB1LPENR_USART2LPEN 17 //!< [1-bit] USART2 clock enable dutin sleep mode
#define RCC_APB1LPENR_I2C1LPEN 21   //!< [1-bit] I2C1 clock enable dutin sleep mode
#define RCC_APB1LPENR_I2C2LPEN 22   //!< [1-bit] I2C2 clock enable dutin sleep mode
#define RCC_APB1LPENR_I2C3LPEN 23   //!< [1-bit] I2C3 clock enable dutin sleep mode
#define RCC_APB1LPENR_PWRLPEN 28    //!< [1-bit] PWR clock enable dutin sleep mode
/** @} */

/**
 * @name APB2LPENR
 * @{
 * @brief APB2 Peripheral Clock Enable in Low Power Mode Register
 */
#define RCC_APB2LPENR_TIM1LPEN 0    //!< [1-bit] Timer 1 clock enable dutin sleep mode
#define RCC_APB2LPENR_USART1LPEN 4  //!< [1-bit] USART1 clock enable dutin sleep mode
#define RCC_APB2LPENR_USART6LPEN 5  //!< [1-bit] USART6 clock enable dutin sleep mode
#define RCC_APB2LPENR_ADC1LPEN 8    //!< [1-bit] ADC1 clock enable dutin sleep mode
#define RCC_APB2LPENR_SDIOLPEN 11   //!< [1-bit] SDIO clock enable dutin sleep mode
#define RCC_APB2LPENR_SPI1LPEN 12   //!< [1-bit] SPI1 clock enable dutin sleep mode
#define RCC_APB2LPENR_SPI4LPEN 13   //!< [1-bit] SPI4 clock enable dutin sleep mode
#define RCC_APB2LPENR_SYSCFGLPEN 14 //!< [1-bit] SYSCFG clock enable dutin sleep mode
#define RCC_APB2LPENR_TIM9LPEN 16   //!< [1-bit] Timer 9 clock enable dutin sleep mode
#define RCC_APB2LPENR_TIM10LPEN 17  //!< [1-bit] Timer 10 clock enable dutin sleep mode
#define RCC_APB2LPENR_TIM11LPEN 18  //!< [1-bit] Timer 11 clock enable dutin sleep mode
/** @} */

/**
 * @name BDCR
 * @{
 * @brief Backup Domain Control Register
 */
#define RCC_BDCR_LSEON 0  //!< [1-bit] External low-speed oscillator enable
#define RCC_BDCR_LSERDY 1 //!< [1-bit] External Low-speed oscillator ready
#define RCC_BDCR_LSEBYP 2 //!< [1-bit] External low-speed oscillator bypass
#define RCC_BDCR_RTCSEL 8 //!< [2-bit] RTC clock source selection
#define RCC_BDCR_RTCEN 15 //!< [1-bit] RTC clock enable
#define RCC_BDCR_BDRST 16 //!< [1-bit] Backup domain software reset
/** @} */

/**
 * @name CSR
 * @{
 * @brief Clock Control & Status Register
 */
#define RCC_CSR_LSION 0     //!< [1-bit] Internal low-speed oscillator enable
#define RCC_CSR_LSIRDY 1    //!< [1-bit] Internal low-speed oscillator ready
#define RCC_CSR_RMVF 24     //!< [1-bit] Remove reset flag
#define RCC_CSR_BORRSTF 25  //!< [1-bit] BOR reset flag
#define RCC_CSR_PINRSTF 26  //!< [1-bit] PIN reset flag
#define RCC_CSR_PORRSTF 27  //!< [1-bit] POR/PDR reset flag
#define RCC_CSR_SFTRSTF 28  //!< [1-bit] Software reset flag
#define RCC_CSR_IWDGRSTF 29 //!< [1-bit] Independent watchdog reset flag
#define RCC_CSR_WWDGRSTF 30 //!< [1-bit] Window watchdog reset flag
#define RCC_CSR_LPWRRSTF 31 //!< [1-bit] Low-power reset flag
/** @} */

/**
 * @name SSCGR
 * @{
 * @brief Spread Spectrum Clock Generation Register
 */
#define RCC_SSCGR_MODPER 0     //!< [13-bit] Modulation period
#define RCC_SSCGR_INCSTEP 13   //!< [15-bit] Incrementation step
#define RCC_SSCGR_SPREADSEL 30 //!< [1-bit] Spread Select
#define RCC_SSCGR_SSCGEN 31    //!< [1-bit] Spread Spectrum modulation enable
/** @} */

/**
 * @name PLLI2SCFG
 * @{
 * @brief PLLI2S Configuration Register
 */
#define RCC_PLLI2SCFGR_PLLI2SN 6  //!< [9-bit] PLLI2S multiplication factor for VCO
#define RCC_PLLI2SCFGR_PLLI2SR 28 //!< [3-bit] PLLI2S division factor I2S clocks
/** @} */

/**
 * @name DCKCFGR
 * @{
 * @brief Dedicated Clocks Configuration Register
 */
#define RCC_DCKCFGR_TIMPRE 24 //!< [1-bit] Timers clocks prescaler selection
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup SYSCFG
 * @{
 * @name Registers
 * @{
 * @name MEMRMP
 * @{
 * @brief Memory Remap Register
 */
#define SYSCFG_MEMRMP_MEM_MODE 0 //!< [2-bit] Memory mapping selection
/** @} */

/**
 * @name PMC
 * @{
 * @brief Peripheral Mode Configurator Register
 */
#define SYSCFG_PMC_ADCxDC2
/** @} */

/**
 * @name EXTICR1
 * @{
 * @brief External Configuration Register 1
 */
#define SYSCFG_EXTICR1_EXTIx 0 //!< [4-bit] EXTI x configuration
/** @} */

/**
 * @name EXTICR2
 * @{
 * @brief External Configuration Register 1
 */
#define SYSCFG_EXTICR2_EXTIx 0 //!< [4-bit] EXTI x configuration
/** @} */

/**
 * @name EXTICR3
 * @{
 * @brief External Configuration Register 1
 */
#define SYSCFG_EXTICR3_EXTIx 0 //!< [4-bit] EXTI x configuration
/** @} */

/**
 * @name EXTICR4
 * @{
 * @brief External Configuration Register 1
 */
#define SYSCFG_EXTICR4_EXTIx 0 //!< [4-bit] EXTI x configuration
/** @} */

/**
 * @name CMPCR
 * @{
 * @brief Compensation Cell Control Register
 */
#define SYSCFG_CMPCR_CMP_PD 0 //!< [1-bit] Compensation cell power-down
#define SYSCFG_CMPCR_READY 8  //!< [1-bit] Compensation cell ready flag
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup DMA
 * @{
 * @name Registers
 * @{
 * @name LISR
 * @{
 * @brief Low Interrupt Status Register
 */
#define DMA_LISR_FEIF0 0   //!< [1-bit] Stream 0 FIFO error interrupt flag
#define DMA_LISR_FEIF1 6   //!< [1-bit] Stream 1 FIFO error interrupt flag
#define DMA_LISR_FEIF2 16  //!< [1-bit] Stream 2 FIFO error interrupt flag
#define DMA_LISR_FEIF3 22  //!< [1-bit] Stream 3 FIFO error interrupt flag
#define DMA_LISR_DMEIF0 1  //!< [1-bit] Stream 0 direct mode error interrupt flag
#define DMA_LISR_DMEIF1 7  //!< [1-bit] Stream 1 direct mode error interrupt flag
#define DMA_LISR_DMEIF2 17 //!< [1-bit] Stream 2 direct mode error interrupt flag
#define DMA_LISR_DMEIF3 23 //!< [1-bit] Stream 3 direct mode error interrupt flag
#define DMA_LISR_HTIF0 4   //!< [1-bit] Stream 0 half transfer interrupt flag
#define DMA_LISR_HTIF1 10  //!< [1-bit] Stream 1 half transfer interrupt flag
#define DMA_LISR_HTIF2 20  //!< [1-bit] Stream 2 half transfer interrupt flag
#define DMA_LISR_HTIF3 26  //!< [1-bit] Stream 3 half transfer interrupt flag
#define DMA_LISR_TCIF0 5   //!< [1-bit] Stream 0 transfer complete interrupt flag
#define DMA_LISR_TCIF1 11  //!< [1-bit] Stream 1 transfer complete interrupt flag
#define DMA_LISR_TCIF2 21  //!< [1-bit] Stream 2 transfer complete interrupt flag
#define DMA_LISR_TCIF3 27  //!< [1-bit] Stream 3 transfer complete interrupt flag
/** @} */

/**
 * @name HISR
 * @{
 * @brief High Interrupt Status Register
 */
#define DMA_HISR_FEIF4 0   //!< [1-bit] Stream 4 FIFO error interrupt flag
#define DMA_HISR_FEIF5 6   //!< [1-bit] Stream 5 FIFO error interrupt flag
#define DMA_HISR_FEIF6 16  //!< [1-bit] Stream 6 FIFO error interrupt flag
#define DMA_HISR_FEIF7 22  //!< [1-bit] Stream 7 FIFO error interrupt flag
#define DMA_HISR_DMEIF4 1  //!< [1-bit] Stream 4 direct mode error interrupt flag
#define DMA_HISR_DMEIF5 7  //!< [1-bit] Stream 5 direct mode error interrupt flag
#define DMA_HISR_DMEIF6 17 //!< [1-bit] Stream 6 direct mode error interrupt flag
#define DMA_HISR_DMEIF7 23 //!< [1-bit] Stream 7 direct mode error interrupt flag
#define DMA_HISR_HTIF4 4   //!< [1-bit] Stream 4 half transfer interrupt flag
#define DMA_HISR_HTIF5 10  //!< [1-bit] Stream 5 half transfer interrupt flag
#define DMA_HISR_HTIF6 20  //!< [1-bit] Stream 6 half transfer interrupt flag
#define DMA_HISR_HTIF7 26  //!< [1-bit] Stream 7 half transfer interrupt flag
#define DMA_HISR_TCIF4 5   //!< [1-bit] Stream 4 transfer complete interrupt flag
#define DMA_HISR_TCIF5 11  //!< [1-bit] Stream 5 transfer complete interrupt flag
#define DMA_HISR_TCIF6 21  //!< [1-bit] Stream 6 transfer complete interrupt flag
#define DMA_HISR_TCIF7 27  //!< [1-bit] Stream 7 transfer complete interrupt flag
/** @} */

/**
 * @name LIFCR
 * @{
 * @brief Low Interrupt Flag Register
 */
#define DMA_LISR_CFEIF0 0   //!< [1-bit] Stream 0 clear FIFO error interrupt flag
#define DMA_LISR_CFEIF1 6   //!< [1-bit] Stream 1 clear FIFO error interrupt flag
#define DMA_LISR_CFEIF2 16  //!< [1-bit] Stream 2 clear FIFO error interrupt flag
#define DMA_LISR_CFEIF3 22  //!< [1-bit] Stream 3 clear FIFO error interrupt flag
#define DMA_LISR_CDMEIF0 2  //!< [1-bit] Stream 0 clear direct mode error interrupt flag
#define DMA_LISR_CDMEIF1 8  //!< [1-bit] Stream 1 clear direct mode error interrupt flag
#define DMA_LISR_CDMEIF2 18 //!< [1-bit] Stream 2 clear direct mode error interrupt flag
#define DMA_LISR_CDMEIF3 24 //!< [1-bit] Stream 3 clear direct mode error interrupt flag
#define DMA_LISR_CTEIF0 3   //!< [1-bit] Stream 0 clear transfer error interrupt flag
#define DMA_LISR_CTEIF1 9   //!< [1-bit] Stream 1 clear transfer error interrupt flag
#define DMA_LISR_CTEIF2 19  //!< [1-bit] Stream 2 clear transfer error interrupt flag
#define DMA_LISR_CTEIF3 24  //!< [1-bit] Stream 3 clear transfer error interrupt flag
#define DMA_LISR_CHTIF0 4   //!< [1-bit] Stream 0 clear half transfer interrupt flag
#define DMA_LISR_CHTIF1 10  //!< [1-bit] Stream 1 clear half transfer interrupt flag
#define DMA_LISR_CHTIF2 20  //!< [1-bit] Stream 2 clear half transfer interrupt flag
#define DMA_LISR_CHTIF3 26  //!< [1-bit] Stream 3 clear half transfer interrupt flag
#define DMA_LISR_CTCIF0 5   //!< [1-bit] Stream 0 clear transfer complete interrupt flag
#define DMA_LISR_CTCIF1 11  //!< [1-bit] Stream 1 clear transfer complete interrupt flag
#define DMA_LISR_CTCIF2 21  //!< [1-bit] Stream 2 clear transfer complete interrupt flag
#define DMA_LISR_CTCIF3 27  //!< [1-bit] Stream 3 clear transfer complete interrupt flag
/** @} */

/**
 * @name HIFCR
 * @{
 * @brief High Interrupt Flag Clear Register
 */
#define DMA_HISR_CFEIF4 0   //!< [1-bit] Stream 4 clear FIFO error interrupt flag
#define DMA_HISR_CFEIF5 6   //!< [1-bit] Stream 5 clear FIFO error interrupt flag
#define DMA_HISR_CFEIF6 16  //!< [1-bit] Stream 6 clear FIFO error interrupt flag
#define DMA_HISR_CFEIF7 22  //!< [1-bit] Stream 7 clear FIFO error interrupt flag
#define DMA_HISR_CDMEIF4 2  //!< [1-bit] Stream 4 clear direct mode error interrupt flag
#define DMA_HISR_CDMEIF5 8  //!< [1-bit] Stream 5 clear direct mode error interrupt flag
#define DMA_HISR_CDMEIF6 18 //!< [1-bit] Stream 6 clear direct mode error interrupt flag
#define DMA_HISR_CDMEIF7 24 //!< [1-bit] Stream 7 clear direct mode error interrupt flag
#define DMA_HISR_CTEIF4 3   //!< [1-bit] Stream 4 clear transfer error interrupt flag
#define DMA_HISR_CTEIF5 9   //!< [1-bit] Stream 5 clear transfer error interrupt flag
#define DMA_HISR_CTEIF6 19  //!< [1-bit] Stream 6 clear transfer error interrupt flag
#define DMA_HISR_CTEIF7 24  //!< [1-bit] Stream 7 clear transfer error interrupt flag
#define DMA_HISR_CHTIF4 4   //!< [1-bit] Stream 4 clear half transfer interrupt flag
#define DMA_HISR_CHTIF5 10  //!< [1-bit] Stream 5 clear half transfer interrupt flag
#define DMA_HISR_CHTIF6 20  //!< [1-bit] Stream 6 clear half transfer interrupt flag
#define DMA_HISR_CHTIF7 26  //!< [1-bit] Stream 7 clear half transfer interrupt flag
#define DMA_HISR_CTCIF4 5   //!< [1-bit] Stream 4 clear transfer complete interrupt flag
#define DMA_HISR_CTCIF5 11  //!< [1-bit] Stream 5 clear transfer complete interrupt flag
#define DMA_HISR_CTCIF6 21  //!< [1-bit] Stream 6 clear transfer complete interrupt flag
#define DMA_HISR_CTCIF7 27  //!< [1-bit] Stream 7 clear transfer complete interrupt flag
/** @} */

