JoseAmador95/stm32f401re/include/stm32f401-registers.h
/**
 * @name SXCR
 * @{
 * @brief Stream X Configuration Register
 */
#define DMA_SXCR_CHSEL 25  //!< [3-bit] Channel selection
#define DMA_SXCR_MBURST 23 //!< [1-bit] Memory burst transfer configuration
#define DMA_SXCR_PBURST 21 //!< [2-bit] Peripheral burst trasnfer configuration
#define DMA_SXCR_CT 19     //!< [1-bit] Current target
#define DMA_SXCR_DBM 18    //!< [1-bit] Double buffer mode
#define DMA_SXCR_PL 16     //!< [1-bit] Priority level
#define DMA_SXCR_PINCOS 15 //!< [1-bit] Peripheral increment offset size
#define DMA_SXCR_MSIZE 13  //!< [2-bit] Memory data size
#define DMA_SXCR_PSIZE 11  //!< [2-bit] Peripheral data size
#define DMA_SXCR_MINC 10   //!< [1-bit] Memory increment mode
#define DMA_SXCR_PINC 9    //!< [1-bit] Perupheral increment mode
#define DMA_SXCR_CIRC 8    //!< [1-bit] Circular mode
#define DMA_SXCR_DIR 6     //!< [1-bit] Data transfer direction
#define DMA_SXCR_PFCTRL 5  //!< [1-bit] Peripheral flow controller
#define DMA_SXCR_TCIE 4    //!< [1-bit] Transfer complete interrupt enable
#define DMA_SXCR_HTIE 3    //!< [1-bit] Half transfer interrupt enable
#define DMA_SXCR_TEIE 2    //!< [1-bit] Transfer error interrupt enable
#define DMA_SXCR_DMEIE 1   //!< [1-bit] Direct mode error interrupt enable
#define DMA_SXCR_EN 0      //!< [1-bit] Stream enable
/** @} */

/**
 * @name SXNDTR
 * @{
 * @brief Stream X Number of Data Register
 */
#define DMA_SXDTR_NDT 0 //!< [16-bit] Number of data items to transfer
/** @} */

/**
 * @name SXPAR
 * @{
 * @brief Stream X Peripheral Address Register
 */
#define DMA_SXPAR_PAR 0 //!< [32-bit] Peripheral address
/** @} */

/**
 * @name SXM0AR
 * @{
 * @brief Stream X Memory 0 Address Register
 */
#define DMA_SXM0AR_M0A 0 //!< [32-bit] Memory 0 address
/** @} */


/**
 * @name SXM1AR
 * @{
 * @brief Stream X Memory 1 Address Register
 */
#define DMA_SXM1AR_M1A 0 //!< [32-bit] Memory 1 address
/** @} */

/**
 * @name SXFCR
 * @{
 * @brief Stream X FIFO Control Register
 */
#define DMA_SXFCR_FTH 0   //!< [2-bit] FIFO threshold selection
#define DMA_SXFCR_DMDIS 2 //!< [1-bit] Direct mode disable
#define DMA_SXFCR_DS 3    //!< [3-bit] FIFO status
#define DMA_SXFCR_FEIE 7  //!< [1-bit] FIFO error interrupt enable
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup ADC
 * @{
 * @name Registers
 * @{
 * @name SR
 * @{
 * @brief Status Register
 */
#define ADC_SR_AWD 0   //!< [1-bit] Analog watchog flag
#define ADC_SR_EOC 1   //!< [1-bit] Regular channel end of conversion
#define ADC_SR_JEOC 2  //!< [1-bit] Injected channel end of conversion
#define ADC_SR_JSTRT 3 //!< [1-bit] Injected channel start flag
#define ADC_SR_STRT 4  //!< [1-bit] Regular channel start flag
#define ADC_SR_OVR 5   //!< [1-bit] Overrun
/** @} */

/**
 * @name CR1
 * @{
 * @brief Control Register 1
 */
#define ADC_CR1_AWDCH 0    //!< [5-bit] Analog watchdog channel select bits
#define ADC_CR1_EOCIE 5    //!< [1-bit] Interrupt enable for EOC
#define ADC_CR1_AWDIE 6    //!< [1-bit] Analog watchdog interrupt enable
#define ADC_CR1_JEOCIE 7   //!< [1-bit] Interrupt enable for injected channels
#define ADC_CR1_SCAN 8     //!< [1-bit] Scan mode
#define ADC_CR1_AWDSGL 9   //!< [1-bit] Enable the watchdog on a single channel in scan mode
#define ADC_CR1_JAUTO 10   //!< [1-bit] Automatic injected group conversion
#define ADC_CR1_DISCEN 11  //!< [1-bit] Discontinous mode on regular channels
#define ADC_CR1_JDISCEN 12 //!< [1-bit] Discontinous mode on injected channels
#define ADC_CR1_DISCNUM 13 //!< [3-bit] Doscontinous mode channel count
#define ADC_CR1_JAWDEN 22  //!< [1-bit] Analog watchdog enable on injected channels
#define ADC_CR1_AWDEN 23   //!< [1-bit] Analog watchdog enable on regular channels
#define ADC_CR1_RES 24     //!< [2-bit] Resolution
#define ADC_CR1_OVRIE 26   //!< [1-bit] Overrun interrupt enable
/** @} */

/**
 * @name CR2
 * @{
 * @brief Control Register 2
 */
#define ADC_CR2_ADON 0      //!< [1-bit] A/D converter On/Off
#define ADC_CR2_CONT 1      //!< [1-bit] Continous conversion
#define ADC_CR2_DMA 8       //!< [1-bit] DMA mode
#define ADC_CR2_DDS 9       //!< [1-bit] DMA disable selection
#define ADC_CR2_EOCS 10     //!< [1-bit] End of conversion selection
#define ADC_CR2_ALIGN 11    //!< [1-bit] Data alignment
#define ADC_CR2_JEXTSEL 16  //!< [4-bit] External event select for injected group
#define ADC_CR2_JEXTEN 20   //!< [1-bit] External trigger enable for injected channels
#define ADC_CR2_JSWSTART 22 //!< [1-bit] Start conversion of injected channels
#define ADC_CR2_EXTSEL 24   //!< [4-bit] External event select for regular group
#define ADC_CR2_EXTEN 28    //!< [1-bit] External trugger enable for regualr channels
#define ADC_CR2_SWSTART 30  //!< [1-bit] Star conversion of regular channels
/** @} */

/**
 * @name SMPR1
 * @{
 * @brief Sample Time Register 1
 */
#define ADC_SMPR1_SMP10 0  //!< [3-bit] Channel 10 sampling time value
#define ADC_SMPR1_SMP11 3  //!< [3-bit] Channel 11 sampling time value
#define ADC_SMPR1_SMP12 6  //!< [3-bit] Channel 12 sampling time value
#define ADC_SMPR1_SMP13 9  //!< [3-bit] Channel 13 sampling time value
#define ADC_SMPR1_SMP14 12 //!< [3-bit] Channel 14 sampling time value
#define ADC_SMPR1_SMP15 15 //!< [3-bit] Channel 15 sampling time value
#define ADC_SMPR1_SMP16 18 //!< [3-bit] Channel 16 sampling time value
#define ADC_SMPR1_SMP17 21 //!< [3-bit] Channel 17 sampling time value
#define ADC_SMPR1_SMP18 24 //!< [3-bit] Channel 18 sampling time value
/** @} */

/**
 * @name SMPR2
 * @{
 * @brief Sample Time Register 2
 */
#define ADC_SMPR2_SMP0 0  //!< [3-bit] Channel 0 sampling time value
#define ADC_SMPR2_SMP1 3  //!< [3-bit] Channel 1 sampling time value
#define ADC_SMPR2_SMP2 6  //!< [3-bit] Channel 2 sampling time value
#define ADC_SMPR2_SMP3 9  //!< [3-bit] Channel 3 sampling time value
#define ADC_SMPR2_SMP4 12 //!< [3-bit] Channel 4 sampling time value
#define ADC_SMPR2_SMP5 15 //!< [3-bit] Channel 5 sampling time value
#define ADC_SMPR2_SMP6 18 //!< [3-bit] Channel 6 sampling time value
#define ADC_SMPR2_SMP7 21 //!< [3-bit] Channel 7 sampling time value
#define ADC_SMPR2_SMP8 24 //!< [3-bit] Channel 8 sampling time value
#define ADC_SMPR2_SMP9 27 //!< [3-bit] Channel 9 sampling time value
/** @} */

/**
 * @name HTR
 * @{
 * @brief Watchdog Higher Threshold Register
 */
#define ADC_HTR_HT 0 //!< [12-bit] Analog watchdog higher threshold
/** @} */

/**
 * @name LTR
 * @{
 * @brief Watchod Lower Threshold Register
 */
#define ADC_LTR_LT 0 //!< [12-bit] Analog watchdog lower threshold
/** @} */

/**
 * @name SQR1
 * @{
 * @brief Regular Sequence Register 1
 */
#define ADC_SQR1_SQ13 0  //!< [5-bit] 13th conversion in regular sequence
#define ADC_SQR1_SQ14 5  //!< [5-bit] 14th conversion in regular sequence
#define ADC_SQR1_SQ15 10 //!< [5-bit] 15th conversion in regular sequence
#define ADC_SQR1_SQ16 15 //!< [5-bit] 16th conversion in regular sequence
#define ADC_SQR1_L 20    //!< [4-bit] Regular channel sequence length
/** @} */

/**
 * @name SQR2
 * @{
 * @brief Regular Sequence Register 2
 */
#define ADC_SQR2_SQ7 0   //!< [5-bit] 7th conversion in regular sequence
#define ADC_SQR2_SQ8 5   //!< [5-bit] 8th conversion in regular sequence
#define ADC_SQR2_SQ9 10  //!< [5-bit] 9th conversion in regular sequence
#define ADC_SQR2_SQ10 15 //!< [5-bit] 10th conversion in regular sequence
#define ADC_SQR2_SQ11 20 //!< [5-bit] 11th conversion in regular sequence
#define ADC_SQR2_SQ12 25 //!< [5-bit] 12th conversion in regular sequence
/** @} */

/**
 * @name SQR3
 * @{
 * @brief Regular Sequence Register 3
 */
#define ADC_SQR3_SQ1 0  //!< [5-bit] 1th conversion in regular sequence
#define ADC_SQR3_SQ2 5  //!< [5-bit] 2th conversion in regular sequence
#define ADC_SQR3_SQ3 10 //!< [5-bit] 3th conversion in regular sequence
#define ADC_SQR3_SQ4 15 //!< [5-bit] 4th conversion in regular sequence
#define ADC_SQR3_SQ5 20 //!< [5-bit] 5th conversion in regular sequence
#define ADC_SQR3_SQ6 25 //!< [5-bit] 6th conversion in regular sequence
/** @} */

/**
 * @name JSQR
 * @{
 * @brief Injected Sequence Register
 */
#define ADC_JSQR_JSQ1 0  //!< [5-bit] 1st conversion in injected sequence
#define ADC_JSQR_JSQ2 5  //!< [5-bit] 2nd conversion in injected sequence
#define ADC_JSQR_JSQ3 10 //!< [5-bit] 3rd conversion in injected sequence
#define ADC_JSQR_JSQ4 15 //!< [5-bit] 4th conversion in injected sequence
#define ADC_JSQR_JL 20   //!< [2-bit] Injected sequence length
/** @} */

/**
 * @name JDRX
 * @{
 * @brief Injected Data Register
 */
#define ADC_JDRX_JDATA 0 // [16-bit] Injected data
/** @} */

/**
 * @name DR
 * @{
 * @brief Data Register
 */
#define ADC_DR_DATA 0 //!< [16-bit] Regular data
/** @} */

/**
 * @name CCR
 * @{
 * @brief Common Control Register
 */
#define ARC_CCR_ADCPRE 16  //!< [1-bit] ADC prescaler
#define ARC_CCR_VBATE 22   //!< [1-bit] \f$V_{bat}\f$ enable
#define ARC_CCR_TSVREFE 23 //!< [1-bit] Temperature sensor \f$V_{REFINT}\f$ enable
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup TIMX
 * @{
 * @name Registers
 * @{
 * @name CR1
 * @{
 * @brief Control Register 1
 */
#define TIMx_CR1_CEN 0  //!< [1-bit] Counter enable
#define TIMx_CR1_UDIS 1 //!< [1-bit] Update disable
#define TIMx_CR1_URS 2  //!< [1-bit] Update request source
#define TIMx_CR1_OPM 3  //!< [1-bit] One pulse mode
#define TIMx_CR1_DIR 4  //!< [1-bit] [Not in TIM9-10-11] Direction
#define TIMx_CR1_CMS 5  //!< [2-bit] [Not in TIM9-10-11] Center-aligned mode selection
#define TIMx_CR1_ARPE 7 //!< [1-bit] Auto-reload preload enable
#define TIMx_CR1_CKD 8  //!< [1-bit] Clock division
/** @} */

/**
 * @name CR2
 * @{
 * @brief Control Register 2
 * @note Not available for TIM9, TIM10 and TIM11
 */
#define TIMx_CR2_CCPC 0   //!< [1-bit] [TIM1 Only] Capture/compare preloaded control
#define TIMx_CR2_CCUS 2   //!< [1-bit] [TIM1 Only] Capture/compare control updae selection
#define TIMx_CR2_CCDS 3   //!< [1-bit] Capture/compare DMA selection
#define TIMx_CR2_MMS 4    //!< [3-bit] Master mode selection
#define TIMx_CR2_TI1S 7   //!< [1-bit] TI1 selection
#define TIMx_CR2_OIS1 8   //!< [1-bit] [TIM1 Only] Output idle state 1
#define TIMx_CR2_OIS1N 9  //!< [1-bit] [TIM1 Only] Output idle state 1
#define TIMx_CR2_OIS2 10  //!< [1-bit] [TIM1 Only] Output Idle state 2
#define TIMx_CR2_OIS2N 11 //!< [1-bit] [TIM1 Only] Output idle state 2
#define TIMx_CR2_OIS3 12  //!< [1-bit] [TIM1 Only] Output idle state 3
#define TIMx_CR2_OIS3N 13 //!< [1-bit] [TIM1 Only] Output idle state 3
#define TIMx_CR2_OIS4 14  //!< [1-bit] [TIM1 Only] Output idle state 4
/** @} */

/**
 * @name SMCR
 * @{
 * @brief Slave Mode Control Register
 * @note Not available for TIM10 and TIM11
 */
#define TIMx_SMCR_SMS 0   //!< [3-bit] Slave mode selection
#define TIMx_SMCR_TS 4    //!< [3-bit] Trigger selection
#define TIMx_SMCR_MSM 7   //!< [1-bit] Master/slave mode
#define TIMx_SMCR_EFT 8   //!< [4-bit] [Not in TIM9] External trigger filter
#define TIMx_SMCR_ETPS 12 //!< [2-bit] [Not in TIM9] External trigger prescaler
#define TIMx_SMCR_ECE 14  //!< [1-bit] [Not in TIM9] External clock enable
#define TIMx_SMCR_ETP 15  //!< [1-bit] [Not in TIM9] External trigger polarity
/** @} */

/**
 * @name DIER
 * @{
 * @brief DMA/Interrupt Enable Register
 */
#define TIMx_DIER_UIE 0    //!< [1-bit] Update Interrupt enable
#define TIMx_DIER_CC1IE 1  //!< [1-bit] Capture/compare 1 interrupt enable
#define TIMx_DIER_CC2IE 2  //!< [1-bit] [Not in TIM10-11] Capture/compare 2 interrupt enable
#define TIMx_DIER_CC3IE 3  //!< [1-bit] [Not in TIM10-11] Capture/compare 3 interrupt enable
#define TIMx_DIER_CC4IE 4  //!< [1-bit] [TIM1 Only] Capture/compare 4 interrupt enable
#define TIMx_DIER_COMIE 5  //!< [1-bit] [Not in TIM9-10-11] COM interrupt enable
#define TIMx_DIER_TIE 6    //!< [1-bit] [Not in TIM9-10-11] Trigger interrupt enable
#define TIMx_DIER_BIE 7    //!< [1-bit] [TIM1 Only] Break interrupt enable
#define TIMx_DIER_UDE 8    //!< [1-bit] [Not in TIM9-10-11]  Update DMA request enable
#define TIMx_DIER_CC1DE 9  //!< [1-bit] [Not in TIM9-10-11] Capture/compare 1 DMA request enable
#define TIMx_DIER_CC2DE 10 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 2 DMA request enable
#define TIMx_DIER_CC3DE 11 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 3 DMA request enable
#define TIMx_DIER_CC4DE 12 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 4 DMA request enable
#define TIMx_DIER_COMDE 13 //!< [1-bit] [Not in TIM9-10-11] [TIM1 Only] COM DMA request enable
#define TIMx_DIER_TDE 14   //!< [1-bit] [Not in TIM9-10-11] Trigger DMA request enable
/** @} */

/**
 * @name ST
 * @{
 * @brief Status Register
 */
#define TIMx_SR_UIF 0    //!< [1-bit] Update interrupt flag
#define TIMx_SR_CC1IF 1  //!< [1-bit] Capture/compare 1 interrupt flag
#define TIMx_SR_CC2IF 2  //!< [1-bit] [Not in TIM10-11] Capture/compare 2 interrupt flag
#define TIMx_SR_CC3IF 3  //!< [1-bit] [Not in TIM10-11] Capture/compare 3 interrupt flag
#define TIMx_SR_CC4IF 4  //!< [1-bit] [Not in TIM10-11] Capture/compare 4 interrupt flag
#define TIMx_SR_COMIF 5  //!< [1-bit] [TIM1 Only] COM interrupt flag
#define TIMx_SR_TIF 6    //!< [1-bit] [Not in TIM10-11] Trigger interrupt flag
#define TIMx_SR_BIF 7    //!< [1-bit] [TIM1 Only] break interrupt flag
#define TIMx_SR_CC1OF 9  //!< [1-bit] Capture/compare 1 overcapture flag
#define TIMx_SR_CC2OF 10 //!< [1-bit] [Not in TIM10-11] Capture/compare 2 overcapture flag
#define TIMx_SR_CC3OF 11 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 3 overcapture flag
#define TIMx_SR_CC4OF 12 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 4 overcapture flag
/** @} */

/**
 * @name EGR
 * @{
 * @brief Event Generation Register
 */
#define TIMx_EGR_UG 0   //!< [1-bit] Update generation
#define TIMx_EGR_CC1G 1 //!< [1-bit] Capture/compare 1 generation
#define TIMx_EGR_CC2G 2 //!< [1-bit] [Not in TIM10-11] Capture/compare 2 gereration
#define TIMx_EGR_CC3G 3 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 3 generation
#define TIMx_EGR_CC4G 4 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 4 generation
#define TIMx_EGR_COMG 5 //!< [1-bit] [TIM1 Only] Capture/compare control update generation
#define TIMx_EGR_TG 6   //!< [1-bit] [Not in TIM10-11] Trigger generation
#define TIMx_EGR_BG 7   //!< [1-bit] [TIM1 Only] Break generation
/** @} */

/**
 * @name CCMR1
 * @{
 * @brief Capture/Compare Mode Register 1
 * @name OCM
 * @{
 * @brief Output Compare Mode
 */
#define TIMx_CCMR1_OCM_CC1S 0   //!< [2-bit] Capture/compare 1 selection
#define TIMx_CCMR1_OCM_OC1FE 2  //!< [1-bit] Output compare 1 fast enable
#define TIMx_CCMR1_OCM_OC1PE 3  //!< [1-bit] Output Compare 1 preload enable
#define TIMx_CCMR1_OCM_OC1M 4   //!< [3-bit] Ouput compare 1 mode
#define TIMx_CCMR1_OCM_OC1CE 7  //!< [1-bit] [Not in TIM10-11] Output compare 1 clear enable
#define TIMx_CCMR1_OCM_CC2S 8   //!< [2-bit] [Not in TIM10-11] Capture/compare 2 selection
#define TIMx_CCMR1_OCM_OC2FE 10 //!< [1-bit] [Not in TIM10-11] Output compare 2 fast enable
#define TIMx_CCMR1_OCM_OC2PE 11 //!< [1-bit] [Not in TIM10-11] Output compare 2 preload enable
#define TIMx_CCMR1_OCM_OC2M 12  //!< [3-bit] [Not in TIM10-11] Output compare 2 mode
#define TIMx_CCMR1_OCM_OC2CE 15 //!< [1-bit] [Not in TIM10-11] Output compare 2 clear enable
/** @} */

/**
 * @name ICM
 * @{
 * @brief Input Capture Mode
 */
#define TIMx_CCMR1_ICM_CC1S 0    //!< [2-bit] Capture/compare 1 selection
#define TIMx_CCMR1_ICM_IC1PSC 2  //!< [2-bit] Input compare 1 prescaler
#define TIMx_CCMR1_ICM_IC1F 4    //!< [4-bit] Input Compare 1 filter
#define TIMx_CCMR1_ICM_CC2S 8    //!< [2-bit] [Not in TIM10-11] Capture/compare 2 selection
#define TIMx_CCMR1_ICM_IC2PSC 10 //!< [2-bit] [Not in TIM10-11] Input compare 2 prescaler
#define TIMx_CCMR1_ICM_IC2F 12   //!< [4-bit] [Not in TIM10-11] Input compare 2 filter
/** @} */
/** @} */

/**
 * @name CCMR2
 * @{
 * @brief Capture/Compare Mode Register 2
 * @note Not available for TIM9, TIM10 and TIM11
 * @name OCM
 * @{
 */
#define TIMx_CCMR2_OCM_CC3S 0   //!< [2-bit] Capture/compare 3 selection
#define TIMx_CCMR2_OCM_OC3FE 2  //!< [1-bit] Output compare 3 fast enable
#define TIMx_CCMR2_OCM_OC3PE 3  //!< [1-bit] Output compare 3 preload enable
#define TIMx_CCMR2_OCM_OC3M 4   //!< [3-bit] Output compare 3 mode
#define TIMx_CCMR2_OCM_OC3CE 7  //!< [1-bit] Output compare 3 clear enable
#define TIMx_CCMR2_OCM_CC4S 8   //!< [2-bit] Capture/compare 4 selection
#define TIMx_CCMR2_OCM_OC4FE 10 //!< [1-bit] Output compare fast enable
#define TIMx_CCMR2_OCM_OC4PE 11 //!< [1-bit] Output compare Preload enable
#define TIMx_CCMR2_OCM_OC4M 12  //!< [2-bit] Output compare 4 mode
#define TIMx_CCMR2_OCM_OC4CE 15 //!< [1-bit] Output compare clear enable
/** @} */

/**
 * @name ICM
 * @{
 * @brief Input Capture Mode
 */
#define TIMx_CCMR2_ICM_CC3S 0    //!< [1-bit] Capture/compare 3 selection
#define TIMx_CCMR2_ICM_IC3PSC 2  //!< [1-bit] Input capture  prescaler
#define TIMx_CCMR2_ICM_IC3F 4    //!< [1-bit] Input capture 3 filter
#define TIMx_CCMR2_ICM_CC4S 8    //!< [1-bit] Capture/compare 4 selection
#define TIMx_CCMR2_ICM_IC4PSC 10 //!< [1-bit] Input capture 4 prescaler
#define TIMx_CCMR2_ICM_IC4F 12   //!< [1-bit] Input capture 4 filter
/** @} */
/** @} */

/**
 * @name CCER
 * @{
 * @brief Capture/Compare Enable Register
 */
#define TIMx_CCER_CC1E 0   //!< [1-bit] Capture/compare 1 output enable
#define TIMx_CCER_CC1P 1   //!< [1-bit] Capture/compare 1 output polarity
#define TIMx_CCER_CC1NE 2  //!< [1-bit] [TIM1 Only] Capture/compare 1 complementary output enable
#define TIMx_CCER_CC1NP 3  //!< [1-bit] Capture/compare 1 complementary output polarity
#define TIMx_CCER_CC2E 4   //!< [1-bit] [Not in TIM10-11] Capture/compare 2 output enable
#define TIMx_CCER_CC2P 5   //!< [1-bit] [Not in TIM10-11] Capture/compare 2 output polarity
#define TIMx_CCER_CC2NE 6  //!< [1-bit] [TIM1 Only] Capture/compare 2 complementary output enable
#define TIMx_CCER_CC2NP 7  //!< [1-bit] [Not in TIM10-11] Capture/compare 2 complementary output polarity
#define TIMx_CCER_CC3E 8   //!< [1-bit] [Not in TIM9-10-11] Capture/compare 3 output enable
#define TIMx_CCER_CC3P 9   //!< [1-bit] [Not in TIM9-10-11] Capture/compare 3 output polarity
#define TIMx_CCER_CC3NE 10 //!< [1-bit] [TIM1 Only] Capture/compare 3 complementary output enable
#define TIMx_CCER_CC3NP 11 //!< [1-bit] [Not in TIM9-10-11] Capture/compare 3 complementary output polarity
#define TIMx_CCER_CC4E 12  //!< [1-bit] [Not in TIM9-10-11] Capture/compare 4 output enable
#define TIMx_CCER_CC4P 13  //!< [1-bit] [Not in TIM9-10-11] Capture/compare 4 output polarity
#define TIMx_CCER_CC4NP 15 //!< [1-bit] [TIM2-5 Only] Capture/compare 4 complementary output polarity
/** @} */

/**
 * @name BDTR
 * @{
 * @brief Break and Dead-Time Register
 * @note Avaiable for TIM1 only
 */
#define TIMx_BDTR_MOE 15  //!< [1-bit] Main output enable
#define TIMx_BDTR_AOE 14  //!< [1-bit] Automatic output enable
#define TIMx_BDTR_BKP 13  //!< [1-bit] Break polarity
#define TIMx_BDTR_BKE 12  //!< [1-bit] Break enable
#define TIMx_BDTR_OSSR 11 //!< [1-bit] Off-state selection for run ode
#define TIMx_BDTR_OSSI 10 //!< [1-bit] Off-state selection for idle mode
#define TIMx_BDTR_LOCK 8  //!< [2-bit] Lock configuration
#define TIMx_BDTR_DTG 0   //!< [8-bit] Dead-time generator setup
/** @} */

/**
 * @name DCR
 * @{
 * @brief DMA Control Register
 */
#define TIMx_DCR_DBA 0 //!< [5-bit] DMA base address
#define TIMx_DCR_DBL 8 //!< [5-bit] DMA burst length
/** @} */

/**
 * @name OR
 * @{
 * @brief Option Register
 * @note Only available for TIM2, TIM5 and TIM11
 */
#define TIMx_OR_TI1_RMP 0  //!< [2-bit] [TIM11 Only] TIM11 input remapping capability
#define TIMx_OR_ITR1_RMP 6 //!< [2-bit] [TIM5 Only] Timer input 4 remap
#define TIMx_OR_TI4_RMP 10 //!< [2-bit] [TIM2 Only] Internal trigger 1 remap
/** @} */
/** @} */
/** @} */

/** 
 * @addtogroup IWDG
 * @{
 * @name Registers
 * @{
 * @name SR
 * @{
 */
#define IWDG_SR_PVU 0 //!< [1-bit] Watchdog prescaler value update
#define IWDG_SR_RVU 1 //!< [1=bit] Watchdog counter reload update
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup WWDG
 * @{
 * @name Registers
 * @{
 * @name CR
 * @{
 * @brief Control Register
 */
#define WWDG_CR_T 0    //!< [7-bit] 7-bit counter
#define WWDG_CR_WDGA 7 //1< [1-bit] Activation bit
/** @} */

/**
 * @name CFG
 * @{
 * @brief Configuration Register
 */
#define WWDG_CFR_W 0     //!< [7-bit] 7-bit window value
#define WWDG_CFR_WDGTB 7 //!< [2-bit] Timer base
#define WWDG_CFR_EWI 9   //!< [1-bit] Early wakeup interrupt
/** @} */

/**
 * @name SR
 * @{
 * @brief Status Register
 */
#define WWDG_SR_EWIF 0 //!< [1-bit] Early wakeup interrupt flag
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup RTC
 * @{
 * @name Registers
 * @{
 * @name TR
 * @{
 * @brief Time Register
 */
#define RTC_TR_SU 0   //!< [4-bit] Seconds unit in BCD format
#define RTC_TR_ST 4   //!< [3-bit] Seconds tens in BCD format
#define RTC_TR_MNU 8  //!< [4-bit] Minute units in BCD format
#define RTC_TR_MNT 12 //!< [3-bit] Minute tens in BCD format
#define RTC_TR_HU 16  //!< [4-bit] Hour unit in BCD format
#define RTC_TR_HT 20  //!< [2-bit] Hour tens in BCD format
#define RTC_TR_PM 22  //!< [1-bit] AM/PM notation
/** @} */

/**
 * @name DR
 * @{
 * @brief Data Register
 * @{
 */
#define RTC_DR_DU 0   //!< [4-bit] Date units in BCD format
#define RTC_DR_DT 4   //!< [2-bit] Date tens in BCD format
#define RTC_DR_MU 8   //!< [4-bit] Month units in BCD format
#define RTC_DR_MT 12  //!< [1-bit] Month tens in BCD format
#define RTC_DR_WDU 13 //!< [3-bit] Week day units
#define RTC_DR_YU 16  //!< [4-bit] Year units in BCD format
#define RTC_DR_YT 20  //!< [4-bit] Year tens in BCD format
/** @} */

/**
 * @name CR
 * @{
 * @brief Control Register
 */
#define RTC_CR_WUCKSEL 0 //!< [3-bit] Wakeup clock selection
#define RTC_CR_TSEDGE 3  //!< [1-bit] Timestamp event active edge
#define RTC_CR_REFCKON 4 //!< [1-bit] Reference clock detection enable
#define RTC_CR_BYPSHAD 5 //!< [1-bit] Bypass the shadow registers
#define RTC_CR_FMT 6     //!< [1-bit] Hour format
#define RTC_CR_DCE 7     //!< [1-bit] Coarse digital calibration enable
#define RTC_CR_ALRAE 8   //!< [1-bit] Alarm A enable
#define RTC_CR_ALRBE 9   //!< [1-bit] Alarm B enable
#define RTC_CR_WUTE 10   //!< [1-bit] Wakeup timer enable
#define RTC_CR_TSE 11    //!< [1-bit] Time stamp enable
#define RTC_CR_ALRAIE 12 //!< [1-bit] Alarm A interrupt enable
#define RTC_CR_ALRBIE 13 //!< [1-bit] Alarm B interrutp enable
#define RTC_CR_WUTIE 14  //!< [1-bit] Wakeup timer interrupt enable
#define RTC_CR_TSIE 15   //!< [1-bit] Timestamp interrupt enable
#define RTC_CR_ADD1H 16  //!< [1-bit] Add 1 hour (summer time change)
#define RTC_CR_SUB1H 17  //!< [1-bit] Substract 1 hour (winter time change)
#define RTC_CR_BKP 18    //!< [1-bit] Backup
#define RTC_CR_COSEL 19  //!< [1-bit] Calibration putput selection
#define RTC_CR_POL 20    //!< [1-bit] Output polarity
#define RTC_CR_OSEL 21   //!< [2-bit] Output selection
#define RTC_CR_COE 23    //!< [1-bit] Calibration output enable
/** @} */

