JoseAmador95/stm32f401re/include/stm32f401-registers.h
/**
 * @name ISR
 * @{
 * @brief Initialization and Status Register
 */
#define RTC_ISR_ALRAWF 0   //!< [1-bit] Alarm A write flag
#define RTC_ISR_ALRBWF 1   //!< [1-bit] Alarm B write flag
#define RTC_ISR_WUTWF 2    //!< [1-bit] Wakeup timer write flag
#define RTC_ISR_SHPF 3     //!< [1-bit] Shift operation pending
#define RTC_ISR_INITS 4    //!< [1-bit] Initialization status flag
#define RTC_ISR_RSF 5      //!< [1-bit] Registers synchronization flag
#define RTC_ISR_INITF 6    //!< [1-bit] Initialization flag
#define RTC_ISR_INIT 7     //!< [1-bit] Initialization mode
#define RTC_ISR_ALRAF 8    //!< [1-bit] Alarm A flag
#define RTC_ISR_ALRBG 9    //!< [1-bit] Alarm B flag
#define RTC_ISR_WUTF 10    //!< [1-bit] Wakeup timer flag
#define RTC_ISR_TSF 11     //!< [1-bit] Timesatamp flag
#define RTC_ISR_TSOVF 12   //!< [1-bit] Timestamp overflow flag
#define RTC_ISR_TAMP1F 13  //!< [1-bit] Tamper detection flag
#define RTC_ISR_RECALPF 16 //!< [1-bit] Recalibration pending flag
/** @} */

/**
 * @name PRER
 * @{
 * @brief Prescaler Register
 */
#define RTC_PRER_PREDIV_S 0  //!< [15-bit] Synchronous prescaler factor
#define RTC_PRER_PREDIV_A 16 //!< [7-bit] Asynchronous prescale factor
/** @} */

/**
 * @name CALIBR
 * @{
 * @brief Calibration Register
 */
#define RTC_CALIBR_DC 0  //!< [5-bit] Digital calibration
#define RTC_CALIBR_DCS 7 //!< [1-bit] Digital calibration sign
/** @} */

/**
 * @name ALRMXR
 * @{
 * @brief Alarm X Register
 */
#define RCT_ALRMxR_SU 0     //!< [4-bit] Second units in BCD format
#define RTC_ALRMxR_ST 4     //!< [3-bit] Second tens in BCD format
#define RTC_ALRMxR_MSK1 7   //!< [1-bit] Alarm A seconds mask
#define RTC_ALRMxR_MNU 8    //!< [4-bit] Minute units un BCD format
#define RTC_ALRMxR_MNT 12   //!< [3-bit] Minute tens in BCD format
#define RTC_ALRMxR_MSK2 15  //!< [1-bit] Alarm A minutes mask
#define RTC_ALRMxR_HU 16    //!< [4-bit] Hour units in BCD format
#define RTC_ALRMxR_HT 20    //!< [2-bit] Hour tesn in BCD format
#define RTC_ALRMxR_PM 22    //!< [1-bit] AM/PM Notation
#define RTC_ALRMxR_MSK3 23  //!< [1-bit] Alarm A hours mask
#define RTC_ALRMxR_DU 24    //!< [4-bit] Date units or day in BCD format
#define RTC_ALRMxR_DT 28    //!< [2-bit] Date tesns in BCD format
#define RTC_ALRMxR_WDSEL 30 //!< [1-bit] Week day selection
#define RTC_ALRMxR_MSK4 31  //!< [1-bit] Alarm A date mask
/** @} */

/**
 * @name SHIFTR
 * @{
 * @brief Shift Control Register
 */
#define RTC_SHIFTR_SUBFS 0  //!< [15-bit] Substract fraction of a second
#define RTC_SHIFTR_ADD1S 31 //!< [1-bit] Add one second
/** @} */

/**
 * @name TSTR
 * @{
 * @brief Time Stamp Time Register
 */
#define RTC_TSTR_SU 0   //!< [4-bit] Second units in BCD format
#define RTC_TSTR_ST 4   //!< [3-bit] Second tens in BCD format
#define RTC_TSTR_MNU 8  //!< [4-bit] Minute units in BCD format
#define RTC_TSTR_MNT 12 //!< [3-bit] Minut tens in BCD format
#define RTC_TSTR_HU 16  //!< [4-bit] Hour units in BCD format
#define RTC_TSTR_HT 20  //!< [2-bit] Hour tens in BCD format
#define RTC_TSTR_PM 22  //!< [1-bit] AM/PM notation
/** @} */

/**
 * @name TSDR
 * @{
 * @brief Time Stamp Date Register
 */
#define RTC_TSDR_DU 0   //!< [4-bit] Date units in BCD format
#define RTC_TSDR_DT 4   //!< [2-bit] Date tens in BCD format
#define RTC_TSDR_MU 8   //!< [4-bit] Month units in BCD format
#define RTC_TSDR_MT 12  //!< [1-bit] Month tens in BCD format
#define RTC_TSDR_WDU 13 //!< [3-bit] Week day units
/** @} */

/**
 * @name TSSSR
 * @{
 * @brief Calibration Register
 */
#define RTC_CALM_CAML 0    //!< [9-bit] Calibration minus
#define RTC_CALM_CALW16 13 //!< [1-bit] Use a 16-second calibration cycle period
#define RTC_CALM_CALW8 14  //!< [1-bit] Use an 8-second calibration cycle period
#define RTC_CALM_CALP 15   //!< [1-bit] Increase frequency of RTC by 488.5 ppm
/** @} */

/**
 * @name TAFCR
 * @{
 * @brief Tamper and Alternate Function Configuration Register
 */
#define RTC_TAFCT_TAMP1E 0        //!< [1-bit] Tamper 1 detection enable
#define RTC_TAFCT_TAMP1TRG 1      //!< [1-bit] Active level for tamper 1
#define RTC_TAFCT_TAMPIE 2        //!< [1-bit] Tamper interrupt enable
#define RTC_TAFCT_TAMPTS 7        //!< [1-bit] Activate timestamp on tamper detection event
#define RTC_TAFCT_TAMPFREQ 8      //!< [3-bit] Tamper sampling frequency
#define RTC_TAFCT_TAMPFLT 11      //!< [2-bit] Tamper filter count
#define RTC_TAFCT_TAMPPRCH 13     //!< [2-bit] Tamper precharge duration
#define RTC_TAFCT_TAMPPUDIS 15    //!< [1-bit] TAMPER pull-up disable
#define RTC_TAFCT_TAMP1INSEL 16   //!< [1-bit] TAMPER1 mapping
#define RTC_TAFCT_TSINSEL 17      //!< [1-bit] TIMESTAMP mapping
#define RTC_TAFCT_ALARMOUTTYPE 18 //!< [1-bit] RTC_ALARM output type
/** @} */

/**
 * @name ALRMXSSR
 * @{
 * @brief Alarm X Sub-Second Register
 */
#define RTC_ALRMxSSR_SS 0      //!< [15-bit] Sub second value
#define RTC_ALRMxSSR_MASKSS 24 //!< [4-bit] Mask the most significant bits starting at this bit
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup SPI_I2S
 * @{
 * @name Registers
 * @{
 * @name CR1
 * @{
 * @brief Control Register 1
 */
#define SPI_CR1_CPHA 0      //!< [1-bit] Clock Phase
#define SPI_CR1_CPOL 1      //!< [1-bit] Clock polarity
#define SPI_CR1_MSTR 2      //!< [1-bit] Master selection
#define SPI_CR1_BR 3        //!< [1-bit] Baud rate control
#define SPI_CR1_SPE 6       //!< [1-bit] SPI Enable
#define SPI_CR1_LSBFIRST 7  //!< [1-bit] Frame format
#define SPI_CR1_SSI 8       //!< [1-bit] Internal Slave Select
#define SPI_CR1_SSM 9       //!< [1-bit] Software Slave Management
#define SPI_CR1_RXONLY 10   //!< [1-bit] Receive Only
#define SPI_CR1_DFF 11      //!< [1-bit] Data frame format
#define SPI_CR1_CRCNEXT 12  //!< [1-bit] CRC transfer next
#define SPI_CR1_CRCEN 13    //!< [1-bit] Hardware CRC calculation enable
#define SPI_CR1_BIDIOE 14   //!< [1-bit] Output enable in bidirectional mode
#define SPI_CR1_BIDIMODE 15 //!< [1-bit] Bidirectional data mode enable
/** @} */

/**
 * @name CR2
 * @{
 * @brief Control Register 2
 */
#define SPI_I2S_I2S_CR2_RXDMAEN 0 //!< [1-bit] RX buffer DMA enable
#define SPI_I2S_CR2_TXDMAEN 1     //!< [1-bit] TX buffer DMA enable
#define SPI_I2S_CR2_SSOE 2        //!< [1-bit] SS output enable
#define SPI_I2S_CR2_FRF 4         //!< [1-bit] Frame Format
#define SPI_I2S_CR2_ERRIE 5       //!< [1-bit] Error interrupt enable
#define SPI_I2S_CR2_RXNEIE 6      //!< [1-bit] RX buffer not empty interrupt enable
#define SPI_I2S_CR2_TXEIE 7       //!< [1-bit] TX buffer empty interrupt enable
/** @} */

/**
 * @name SR
 * @{
 * @brief Status Register
 */
#define SPI_I2S_SR_RXNE 0   //!< [1-bit] RX buffer not empty
#define SPI_I2S_SR_TXE 1    //!< [1-bit] Tx buffer empty
#define SPI_I2S_SR_CHSIDE 2 //!< [1-bit] Channel Side
#define SPI_I2S_SR_UDR 3    //!< [1-bit] Underrun flag
#define SPI_I2S_SR_CRCERR 4 //!< [1-bit] CRC error flag
#define SPI_I2S_SR_MODF 5   //!< [1-bit] Mode fault
#define SPI_I2S_SR_OVR 6    //!< [1-bit] Overrun flag
#define SPI_I2S_SR_BSY 7    //!< [1-bit] Busy flag
#define SPI_I2S_SR_FRE 8    //!< [1-bit] Frame format error
/** @} */

/**
 * @name I2SCFGR
 * @{
 * @brief I2S Configuration Register
 */
#define SPI_I2S_I2SCFGR_CHLEN 0   //!< [1-bit] Channel length (bits per audio channel)
#define SPI_I2S_I2SCFGR_DATLEN 1  //!< [2-bit] Data length to be transfered
#define SPI_I2S_I2SCFGR_CKPOL 3   //!< [1-bit] Steady state clock polarity
#define SPI_I2S_I2SCFGR_I2SSTD 4  //!< [2-bit] I2S standard selection
#define SPI_I2S_I2SCFGR_PCMSYNC 7 //!< [1-bit] PCM frame synchronization
#define SPI_I2S_I2SCFGR_I2SCFG 8  //!< [2-bit] I2S configuration mode
#define SPI_I2S_I2SCFGR_I2SE 10   //!< [1-bit] I2S enable
#define SPI_I2S_I2SCFGR_I2SMOD 11 //!< [1-bit] I2S mode selection
/** @} */

/**
 * @name I2SPR
 * @{
 * @brief I2S Prescaler Register
 */
#define SPI_I2S_I2SPR_I2SDIV 0 //!< [8-bit] I2S linear prescaler
#define SPI_I2S_I2SPR_ODD 8    //!< [1-bit] Odd factor for the prescaler
#define SPI_I2S_I2SPR_MCKOE 9  //!< [1-bit] Master clock output enable
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup I2C
 * @{
 * @name Registers
 * @{
 * @name CR1
 * @{
 * @brief Control Register 1
 */
#define I2C_CR1_PE 0        //!< [1-bit] Peripheral enable
#define I2C_CR1_SMBUS 1     //!< [1-bit] SMBus mode
#define I2C_CR1_SMBTYPE 3   //!< [1-bit] SMBus type
#define I2C_CR1_ENARP 4     //!< [1-bit] APR enable
#define I2C_CR1_ENPEC 5     //!< [1-bit] PEC enable
#define I2C_CR1_ENGC 6      //!< [1-bit] General call enable
#define I2C_CR1_NOSTRETCH 7 //!< [1-bit] Clock stretching disable
#define I2C_CR1_START 8     //!< [1-bit] Start generation
#define I2C_CR1_STOP 9      //!< [1-bit] Stop generation
#define I2C_CR1_ACK 10      //!< [1-bit] Acknowledge enable
#define I2C_CR1_POS 11      //!< [1-bit] Acknowledge/PEC position
#define I2C_CR1_PEC 12      //!< [1-bit] Packet error checking
#define I2C_CR1_ALERT 13    //!< [1-bit] SMBus alert
#define I2C_CR1_SWRST 15    //!< [1-bit] Software reset
/** @} */

/**
 * @name CR2
 * @{
 * @brief Control Register 2
 */
#define I2C_CR2_FREQ 0     //!< [6-bit] Peripheral clock frequency
#define I2C_CR2_ITERREN 8  //!< [1-bit] Error interrupt enable
#define I2C_CR2_ITEVTEN 9  //!< [1-bit] Event interrupt enable
#define I2C_CR2_ITBUFEN 10 //!< [1-bit] Buffer interrupt enable
#define I2C_CR2_DMAEN 11   //!< [1-bit] DMA request enable
#define I2C_CR2_LAST 12    //!< [1-bit] DMA last transfer
/** @} */

/**
 * @name QAR1
 * @{
 * @brief Own Address Register 1
 */
#define I2C_OAR1_ADD0 0     //!< [1-bit] Interface address
#define I2C_OAR1_ADD71 1    //!< [7-bit] Interface address
#define I2C_OAR1_ADD98 8    //!< [2-bit] Interface address
#define I2C_OAR1_KEEP1 14   //!< [1-bit] Always set this bit
#define I2C_OAR1_ADDMODE 15 //!< [1-bit] Addressing mode
/** @} */

/**
 * @name OAR2
 * @{
 * @brief Own Address Register 2
 */
#define I2C_OAR2_ENDUAL 0 //!< [1-bit] Dual addressing mode enable
#define I2C_OAR2_ADD2 1   //!< [7-bit] Interface address
/** @} */

/**
 * @name DR
 * @{
 * @brief Data Register
 */
#define I2C_DR_DR 0 //!< [8-bit] 8-bit data register
/** @} */

/**
 * @name SR1
 * @{
 * @brief Status Register 1
 */
#define I2C_SR1_SB 0        //!< [1-bit] Start bit
#define I2C_SR1_ADDR 1      //!< [1-bit] Address sent
#define I2C_SR1_BTF 2       //!< [1-bit] Byte transfer finished
#define I2C_SR1_ADD10 3     //!< [1-bit] 10-bit header sent
#define I2C_SR1_STOPF 4     //!< [1-bit] Stop detection
#define I2C_SR1_RXNE 6      //!< [1-bit] Data register not empty
#define I2C_SR1_TXE 7       //!< [1-bit] Data register empty
#define I2C_SR1_BERR 8      //!< [1-bit] Bus error
#define I2C_SR1_ARLO 9      //!< [1-bit] Arbitration lost
#define I2C_SR1_AF 10       //!< [1-bit] Acknowledge failure
#define I2C_SR1_OVR 11      //!< [1-bit] Overrun/Underrun
#define I2C_SR1_PECERR 12   //!< [1-bit] PEC error in reception
#define I2C_SR1_TIMEOUT 14  //!< [1-bit] Timeout or TIow error
#define I2C_SR1_SMBALERT 15 //!< [1-bit] SMBus alert
/** @} */

/**
 * @name SR2
 * @{
 * @brief Status Register 2
 */
#define I2C_SR2_MSL 0        //!< [1-bit] Master/Slave
#define I2C_SR2_BUSY 1       //!< [1-bit] Bus busy
#define I2C_SR2_TRA 2        //!< [1-bit] Transmitter/Receiver
#define I2C_SR2_GENCALL 4    //!< [1-bit] General call address (Slave mode)
#define I2C_SR2_SMBDEFAULT 5 //!< [1-bit] SMBus device default address
#define I2C_SR2_DUALF 7      //!< [1-bit] Dual flag
#define I2C_SR2_PEC 8        //!< [8-bit] Packet error checking register
/** @} */

/**
 * @name CCR
 * @{
 * @brief Clock Control Register
 */
#define I2C_CCR_CCR 0   //!< [12-bit] Clock conrol register in Fm/Sm mode
#define I2C_CCR_DUTY 14 //!< [1-bit] Fm mode duty cycle
#define I2C_CCR_FS 15   //!< [1-bit] I2C master mode selection
/** @} */

/**
 * @name TRISE
 * @{
 * @brief TRISE Register
 */
#define I2C_TRISE_TRISE 0 //!< [6-bit] Maximum rise time in Fm/Sm mode
/** @} */

/**
 * @name FLTR
 * @{
 * @brief FLTR Register
 */
#define I2C_FLTR_DNF 0   //!< [4-bit] Digital noise filter
#define I2C_FLTR_ANOFF 4 //!< [1-bit] Analog noise filter off
/** @} */
/** @} */
/** @} */

/**
 * @addtogroup USART
 * @{
 * @name Registers
 * @{
 * @name SR
 * @{
 * @brief Status Register
 */
#define USART_SR_PE 0   //!< [1-bit] Parity error
#define USART_SR_FE 1   //!< [1-bit] Framing error
#define USART_SR_NF 2   //!< [1-bit] Noise detected flag
#define USART_SR_ORE 3  //!< [1-bit] Overrun error
#define USART_SR_IDLE 4 //!< [1-bit] IDLE line detected
#define USART_SR_RXNE 5 //!< [1-bit] Read data register not empty
#define USART_SR_TC 6   //!< [1-bit] Transmission complete
#define USART_SR_TXE 7  //!< [1-bit] Transmit data register empty
#define USART_SR_LBD 8  //!< [1-bit] LIN break detection flag
#define USART_SR_CTS 9  //!< [1-bit] CTS flag
/** @} */

/**
 * @name CR1
 * @{
 * @brief Control Register 1
 */
#define USART_CR1_SBK 0    //!< [1-bit] Send break
#define USART_CR1_RWU 1    //!< [1-bit] Receiver wakeup
#define USART_CR1_RE 2     //!< [1-bit] Receiver enable
#define USART_CR1_TE 3     //!< [1-bit] Transmitter enable
#define USART_CR1_IDLEIE 4 //!< [1-bit] IDLE interrupt enable
#define USART_CR1_RXNEIE 5 //!< [1-bit] RXNE interrupt enable
#define USART_CR1_TCIE 6   //!< [1-bit] Transmission complete interrupt enable
#define USART_CR1_TXEIE 7  //!< [1-bit] TXE interrupt enable
#define USART_CR1_PEIE 8   //!< [1-bit] PE interrupt enable
#define USART_CR1_PS 9     //!< [1-bit] Parity selection
#define USART_CR1_PCE 10   //!< [1-bit] Parity control enable
#define USART_CR1_WAKE 11  //!< [1-bit] Wakeup method
#define USART_CR1_M 12     //!< [1-bit] Word length
#define USART_CR1_UE 13    //!< [1-bit] USART enable
#define USART_CR1_OVER8 15 //!< [1-bit] Oversampling mode
/** @} */

/**
 * @name CR2
 * @{
 * @brief Control Register 2
 */
#define USART_CR2_ADD 0    //!< [1-bit] LIN break detection length
#define USART_CR2_LBDL 5   //!< [1-bit] LIN break detection interrupt enable
#define USART_CR2_LBDIE 6  //!< [1-bit] Last bit clock pulse
#define USART_CR2_LBCL 8   //!< [1-bit] Last bit clock pulse
#define USART_CR2_CPHA 9   //!< [1-bit] Clock phase
#define USART_CR2_CPOL 10  //!< [1-bit] Clock polarity
#define USART_CR2_CLKEN 11 //!< [1-bit] Clock enable
#define USART_CR2_STOP 12  //!< [1-bit] STOP bits
#define USART_CR2_LINEN 14 //!< [1-bit] LIN mode enable
/** @} */

/**
 * @name CR3
 * @{
 * @brief Control Register 3
 */
#define USART_CR3_EIE 0     //!< [1-bit] Error interrupt enable
#define USART_CR3_IREN 1    //!< [1-bit] IrDA mode enable
#define USART_CR3_IRLP 2    //!< [1-bit] IrDA low-power
#define USART_CR3_HDSEL 3   //!< [1-bit] Half-duplex selection
#define USART_CR3_NACK 4    //!< [1-bit] Smartcard NACK enable
#define USART_CR3_SCEN 5    //!< [1-bit] Smartcard mode enable
#define USART_CR3_DMAR 6    //!< [1-bit] DMA enable receiver
#define USART_CR3_DMAT 7    //!< [1-bit] DMA enable transmitter
#define USART_CR3_RTSE 8    //!< [1-bit] RTS enable
#define USART_CR3_CTSE 9    //!< [1-bit] CTS enable
#define USART_CR3_CTSIE 10  //!< [1-bit] CTS interrupt enable
#define USART_CR3_ONEBIT 11 //!< [1-bit] One bit sample method enable
/** @} */

/**
 * @name GTPR
 * @{
 * @brief Guard Time and Prescaler Register
 */
#define USART_GTPR_PSC 0 //!< [8-bit] Prescaler value
#define USART_GTPR_FT 8  //!< [8-bit] Guard time value
/** @} */
/** @} */
/** @} */

#endif
